#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:056212709895:cluster/app_cluster]
aws_vpc.vpc: Refreshing state... [id=vpc-07f6c49d20d0aa9b1]
aws_ecr_repository.repo: Refreshing state... [id=app_repo]
aws_ecs_task_definition.td: Refreshing state... [id=app]
aws_internet_gateway.gw: Refreshing state... [id=igw-09bcf2e3ff87d8014]
aws_subnet.sn2: Refreshing state... [id=subnet-034e7c1787d9dd05a]
aws_subnet.sn3: Refreshing state... [id=subnet-03dd4526c50b597a9]
aws_subnet.sn1: Refreshing state... [id=subnet-082b958c5740adb29]
aws_security_group.sg: Refreshing state... [id=sg-0a8e8e9f08c728703]
aws_route_table.rt: Refreshing state... [id=rtb-0ea4e5ae8c3d1817a]
aws_route_table_association.route2: Refreshing state... [id=rtbassoc-07fab8c0fc2389174]
aws_route_table_association.route3: Refreshing state... [id=rtbassoc-04f319b0bbdb3ad65]
aws_route_table_association.route1: Refreshing state... [id=rtbassoc-0cd52d6ffacec214f]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:056212709895:service/app_cluster/app_service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:056212709895:service/app_cluster/app_service"
        name                               = "app_service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:056212709895:task-definition/app:5" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.td must be replaced
-/+ resource "aws_ecs_task_definition" "td" {
      ~ arn                      = "arn:aws:ecs:us-east-1:056212709895:task-definition/app:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:056212709895:task-definition/app" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment  = []
                  ~ image        = "056212709895.dkr.ecr.us-east-2.amazonaws.com/app_repo" -> "056212709895.dkr.ecr.us-east-1.amazonaws.com/app_repo"
                  - mountPoints  = []
                    name         = "app"
                  ~ portMappings = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom  = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "app" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vperezcerv, Action: `pull_request`*